---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.Clear
source: html/5d67f734-ab88-6788-e6ce-3a41aede826e.htm
---
# Autodesk.Revit.DB.CurtainGridSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```